#+TITLE: Run Web App Without A Server

* The Ticket
[[https://github.com/cncf/apisnoop/issues/474]]
#+begin_quote
the server in snoopApp is a vestigial organ from when apisnoop pulled from a database. Since all our data is coming from files available on github, we no longer need it. If we have the web app run client-side, it will allow us to host it in more places, like netlify, and bring in the code to this repo (instead of where it sits now at apisnoop/snoopApp)
#+end_quote
* Strategy
- Keep changes small
  This is not meant as a refactor.  Keep code logic as-is, as much as possible.
- Use pagejs instead of sapper
  it is simple, popular, and well-tested
- Start from fresh dir
  making a new dir, ~apps/web~ as ~app/snoopApp~ is both redundant and unclear.  This  will also allow us to reduce dependencies to only what's needed.
- Lose no existing routing functionality
  All routes need to stay exactly the same
* Process
** DONE create new dir with basic svelte project
: npx degit npx degit sveltejs/template web
** DONE Install pagejs
#+NAME: Install pagejs
#+begin_src shell :dir ../../apps/web
npm install page
#+end_src
** DONE Adjust scripts to work with page
in package.json we update our start script to
: "start": "sirv public --single"
** DONE Setup Project structure
#+begin_src shell :dir ../../apps/web/src
mkdir -p pages components store lib
tree
#+end_src

#+RESULTS:
| .   |              |   |       |
| ├── | App.svelte   |   |       |
| ├── | components   |   |       |
| ├── | lib          |   |       |
| ├── | main.js      |   |       |
| ├── | pages        |   |       |
| └── | store        |   |       |
|     |              |   |       |
| 4   | directories, | 2 | files |

** DONE Get basic Homepage and About Page working in new Router
This is just to get routing setup, basic pages made in our pages dir for Home and About
The router is setup in the main [[file:~/ii/apisnoop/apps/web/src/App.svelte][App.svelte file]] in a straightforward manner,
you set up the routes within your ~<script>~ and then credate a svelte component that shows depending on whatever is the current route.
** STRT Homepage shows sunburst
Purpose of this is to ensure our store and components are working.
*** DONE Install Lodash
*** DONE Bring over lib files
*** DONE Bring over store files
*** DONE Get Nav Showing AGain
*** DONE Fix relative paths
*** DONE Bring in Nav bar
*** DONE Bring in Sunburst
*** DONE Bring in new endpoints
** TODO Get all paths of main sunburst working w router
*** TODO Can go to different versions(releases) by url
*** TODO Can go to different levels by url
*** TODO Can go to different categories by url
*** TODO Can go to different endpoints by url
*** TODO can go to all sets by clicking in sunburst
*** TODO latest route works
** TODO Get all paths in conformance-progress working in router
** TODO Host site on netlify
** TODO open PR
